orderPricePlan/templates/payloads/ChangeSubOffering.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bcs="http://www.huawei.com/bme/cbsinterface/bcservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:bcc="http://www.huawei.com/bme/cbsinterface/bccommon">
   <soapenv:Header/>
   <soapenv:Body>
      <bcs:ChangeSubOfferingRequestMsg>
         <RequestHeader>
            <cbs:Version>1</cbs:Version>
            <cbs:BusinessCode>ChangeSubOffering</cbs:BusinessCode>
            <cbs:MessageSeq>$datetime</cbs:MessageSeq>
            <cbs:AccessSecurity>
               <cbs:LoginSystemCode>102</cbs:LoginSystemCode>
               <cbs:Password>7/PuyYwNpRtSX7jDpxnl2ECAvuVYH2Mu9zxqgPGJrPYYK73MCZN7DvrDepA=</cbs:Password>
            </cbs:AccessSecurity>
            <cbs:OperatorInfo>
               <cbs:OperatorID>101</cbs:OperatorID>
            </cbs:OperatorInfo>
         </RequestHeader>
         <ChangeSubOfferingRequest>
            <bcs:SubAccessCode>
               <bcc:PrimaryIdentity>$msisdn</bcc:PrimaryIdentity>
            </bcs:SubAccessCode>
            <bcs:SupplementaryOffering>
               <bcs:AddOffering>
                  <bcc:OfferingKey>
                     <bcc:OfferingCode>sms_rate_language</bcc:OfferingCode>
                     <bcc:PurchaseSeq>$offerCode</bcc:PurchaseSeq>
                  </bcc:OfferingKey>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_CHANNEL_ID</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>$channelId</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>C_FREE_FIRSTMRC</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>$C_FREE_PAY_FLAG</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_PAY_FLAG</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>$payFlag</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_AU</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>$au</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_FIRST_AMOUNT</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>$amount</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_BANK_ID</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>$bankId</bcc:Value>
                  </bcc:OInstProperty>
                  <bcc:OInstProperty>
                     <bcc:PropCode>CN_CALLER_ID</bcc:PropCode>
                     <bcc:PropType>1</bcc:PropType>
                     <bcc:Value>$CallerID</bcc:Value>
                  </bcc:OInstProperty>
                  <bcs:EffectiveTime>
                     <bcc:Mode>I</bcc:Mode>
                  </bcs:EffectiveTime>
               </bcs:AddOffering>
            </bcs:SupplementaryOffering>
            <bcs:OperationCode>4052485</bcs:OperationCode>
         </ChangeSubOfferingRequest>
      </bcs:ChangeSubOfferingRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>